In [5]:
import pandas as pd

In [35]:
#series de pandas: Son estructuras de datos unidimensionales que nos permiten almacenar cualquier tipo de datos
numeros = [3,4,5,7,8]
serie = pd.Series(numeros)
serie, type(serie)

(0    3
 1    4
 2    5
 3    7
 4    8
 dtype: int64,
 pandas.core.series.Series)

In [36]:
#DataFrame: Es una esctructura de datos bidimensional como si fuera una matriz
datos = {
    "Nombre":["Ana","Juan", "Pedro","Maria","Luis"],
    "Edad":[22,25,28,23,20],
    "Ciudad":["Barcelona","Madrid","Valencia","Sevilla","Bilboa"]
}
datos, type(datos)

({'Nombre': ['Ana', 'Juan', 'Pedro', 'Maria', 'Luis'],
  'Edad': [22, 25, 28, 23, 20],
  'Ciudad': ['Barcelona', 'Madrid', 'Valencia', 'Sevilla', 'Bilboa']},
 dict)

In [37]:
#Generar DataFrame a partir de un diccionario
df = pd.DataFrame(data = datos)
df

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
1   Juan    25     Madrid
2  Pedro    28   Valencia
3  Maria    23    Sevilla
4   Luis    20     Bilboa

In [38]:
#Exportar un DataFrame
df.to_csv("Data.csv")

In [39]:
#Importar DataFrame
import_df = pd.read_csv("Data.csv", index_col=0)
import_df

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
1   Juan    25     Madrid
2  Pedro    28   Valencia
3  Maria    23    Sevilla
4   Luis    20     Bilboa

In [40]:
# Seleccionar una columna
nombres = df["Nombre"]
# nombres, type(nombres)

df[["Nombre", "Edad"]]

  Nombre  Edad
0    Ana    22
1   Juan    25
2  Pedro    28
3  Maria    23
4   Luis    20

In [41]:
#Filtrar por indice 
fila = df.loc[2]
fila

Nombre       Pedro
Edad            28
Ciudad    Valencia
Name: 2, dtype: object

In [42]:
#Filtrar por codicion
df[df["Edad"] > 23]

  Nombre  Edad    Ciudad
1   Juan    25    Madrid
2  Pedro    28  Valencia

In [43]:
filtro = (df["Edad"] > 23) & (df["Nombre"].str.startswith("P"))
df[filtro]

  Nombre  Edad    Ciudad
2  Pedro    28  Valencia

In [44]:
# Filtar Persona mayores de 23 años, por query
df.query("Edad > 23")

  Nombre  Edad    Ciudad
1   Juan    25    Madrid
2  Pedro    28  Valencia

In [45]:
df[df["Nombre"].isin(["Ana","Carlos","Maria","Luis"])]

  Nombre  Edad     Ciudad
0    Ana    22  Barcelona
3  Maria    23    Sevilla
4   Luis    20     Bilboa

In [46]:
def longitud_5(nombre):
    return len(nombre) == 5

df[df["Nombre"].apply(longitud_5)]

  Nombre  Edad    Ciudad
2  Pedro    28  Valencia
3  Maria    23   Sevilla

In [47]:
#Filtrar por edades entre 25 y 35 años (inclusivo) 
df[df["Edad"].between(25, 35)]

  Nombre  Edad    Ciudad
1   Juan    25    Madrid
2  Pedro    28  Valencia

In [6]:
import numpy as np;
data = {
    "Nombre":["Ana","Juan", "Pedro","Maria","Luis"],
    "Edad":[22,25,np.nan,23,20],
    "Ciudad":["Barcelona","Madrid","Valencia",None,"Bilboa"]
}
df = pd.DataFrame(data)
df

  Nombre  Edad     Ciudad
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
2  Pedro   NaN   Valencia
3  Maria  23.0       None
4   Luis  20.0     Bilboa

In [7]:
#rellenar los valores faltantes
df_fill = df.fillna(
    {
        "Edad": df["Edad"].mean(),
        "Ciudad": "Desconocido"
    }
)
df_fill

  Nombre  Edad       Ciudad
0    Ana  22.0    Barcelona
1   Juan  25.0       Madrid
2  Pedro  22.5     Valencia
3  Maria  23.0  Desconocido
4   Luis  20.0       Bilboa

In [8]:
#Eliminar las filas con valores faltantes
df_sin_nan = df.dropna()
df_sin_nan

  Nombre  Edad     Ciudad
0    Ana  22.0  Barcelona
1   Juan  25.0     Madrid
4   Luis  20.0     Bilboa

In [9]:
#Reemplazar valores especificios de alguna columna
#Nota: Se pueden reemplazar tantos valores como se desee, la unica regla es ser especifico

df_reem = df.replace(
   { "Ciudad": {None: "Desconocido", "x": "y"}}
)

df_reem

  Nombre  Edad       Ciudad
0    Ana  22.0    Barcelona
1   Juan  25.0       Madrid
2  Pedro   NaN     Valencia
3  Maria  23.0  Desconocido
4   Luis  20.0       Bilboa